In [7]:
import pandas as pd

In [8]:
!pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: openpyxl in c:\users\croma campus\appdata\roaming\python\python313\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\croma campus\appdata\roaming\python\python313\site-packages (from openpyxl) (2.0.0)

[notice] A new release of pip is available: 25.1.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [9]:
# Series (1D) , Dataframes (2D Tabular Format (table))

In [26]:
data = {
    'Empid':[101,102,103,104,105,106,107,108,109,110],
    'Empname':['Raj','Anu','Rahul','Anuj','Aman','Anu','Riya','Mohan','Kamal','Siya'],
    'Empsalary':[35466,78675,34567,89765,34556,87543,45678,97643,23466,90987]
}

In [27]:
df = pd.DataFrame(data)

In [28]:
df

   Empid Empname  Empsalary
0    101     Raj      35466
1    102     Anu      78675
2    103   Rahul      34567
3    104    Anuj      89765
4    105    Aman      34556
5    106     Anu      87543
6    107    Riya      45678
7    108   Mohan      97643
8    109   Kamal      23466
9    110    Siya      90987

In [29]:
df.Empname

0      Raj
1      Anu
2    Rahul
3     Anuj
4     Aman
5      Anu
6     Riya
7    Mohan
8    Kamal
9     Siya
Name: Empname, dtype: object

In [30]:
df.Empsalary

0    35466
1    78675
2    34567
3    89765
4    34556
5    87543
6    45678
7    97643
8    23466
9    90987
Name: Empsalary, dtype: int64

In [31]:
df.head()

   Empid Empname  Empsalary
0    101     Raj      35466
1    102     Anu      78675
2    103   Rahul      34567
3    104    Anuj      89765
4    105    Aman      34556

In [32]:
df.head(2)

   Empid Empname  Empsalary
0    101     Raj      35466
1    102     Anu      78675

In [33]:
df.tail(3)

   Empid Empname  Empsalary
7    108   Mohan      97643
8    109   Kamal      23466
9    110    Siya      90987

In [34]:
df['Empname']

0      Raj
1      Anu
2    Rahul
3     Anuj
4     Aman
5      Anu
6     Riya
7    Mohan
8    Kamal
9     Siya
Name: Empname, dtype: object

In [35]:
df.Empsalary.sum()

np.int64(618346)

In [36]:
df.Empname.value_counts()

Empname
Anu      2
Raj      1
Rahul    1
Anuj     1
Aman     1
Riya     1
Mohan    1
Kamal    1
Siya     1
Name: count, dtype: int64

In [37]:
df.Empsalary.mean()

np.float64(61834.6)

In [38]:
import numpy as np

In [56]:
data = {
    'Empid':[101,102,103,104,105,102,107,108,109,110],
    'Empname':['Raj','Anu','Rahul','Anuj',np.nan,'Anu','Riya',np.nan,'Kamal','Siya'],
    'Empsalary':[35466,np.nan,34567,np.nan,34556,np.nan,45678,97643,23466,90987]
}

In [57]:
df = pd.DataFrame(data)

In [58]:
df

   Empid Empname  Empsalary
0    101     Raj    35466.0
1    102     Anu        NaN
2    103   Rahul    34567.0
3    104    Anuj        NaN
4    105     NaN    34556.0
5    102     Anu        NaN
6    107    Riya    45678.0
7    108     NaN    97643.0
8    109   Kamal    23466.0
9    110    Siya    90987.0

In [59]:
df.isnull()

   Empid  Empname  Empsalary
0  False    False      False
1  False    False       True
2  False    False      False
3  False    False       True
4  False     True      False
5  False    False       True
6  False    False      False
7  False     True      False
8  False    False      False
9  False    False      False

In [60]:
df.isnull().sum()

Empid        0
Empname      2
Empsalary    3
dtype: int64

In [61]:
df.Empsalary.isnull().sum()

np.int64(3)

In [62]:
df.Empid.duplicated().sum()

np.int64(1)

In [63]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8    False
9    False
dtype: bool

In [76]:
df = df.drop_duplicates()

In [77]:
df

   Empid Empname  Empsalary
0    101     Raj    35466.0
1    102     Anu        NaN
2    103   Rahul    34567.0
3    104    Anuj        NaN
4    105     NaN    34556.0
6    107    Riya    45678.0
7    108     NaN    97643.0
8    109   Kamal    23466.0
9    110    Siya    90987.0

In [79]:
df.dropna()

   Empid Empname  Empsalary
0    101     Raj    35466.0
2    103   Rahul    34567.0
6    107    Riya    45678.0
8    109   Kamal    23466.0
9    110    Siya    90987.0